изделие(1,сахар, [25,17,78], вымпел).
изделие(2,сахар, [7,54,20], дон).
изделие(3,мука,[89,34,11], завод_1).
изделие(12,соль, [20], дон).
изделие(31,хлеб,[22,11,12,56,9], завод_1).

summ([], 0)    :- !.
summ([X|Y], S) :- summ(Y, SS), S is SS + X.

% Сначала по названию товара, затем по суммарному количеству
 cmp1(>, изделие(_, N1, _, _),  изделие(_, N2, _, _))  :- compare(>, N1, N2).
 cmp1(>, изделие(_, N1, L1, _), изделие(_, N2, L2, _)) :-
     compare(=, N1, N2), sum_list(L1, S1), sum_list(L2, S2), S1 > S2.
 cmp1(<, _, _).

 % Сначала по названию производителя, затем по суммарному количеству
 cmp2(<, изделие(_, _, _, N1),  изделие(_, _, _, N2))  :- compare(<, N1, N2).
 cmp2(<, изделие(_, _, L1, N1), изделие(_, _, L2, N2)) :-
     compare(=, N1, N2), sum_list(L1, S1), sum_list(L2, S2), S1 < S2.
 cmp2(>, _, _).

 my_sort(CC) :-
     findall(изделие(N, S, P, R), изделие(N, S, P, R), L), writeln(L),
     predsort(CC, L, LS), writef('sort\n%w', [LS]).
