% «Консультант по транспорту»

% транспорт, откуда, куда
% путь(метро,  'Советский район', 'Сельмаш').
путь(метро,  'Советский район', 'Александровка').
путь(метро,  'Александровка',   'Сельмаш').
путь(метро,  'Сельмаш',         'Аксай').


достижимо(Транспорт, Пункт1, Пункт2) :-
    ( путь(Транспорт, Пункт1, Пункт2); путь(Транспорт, Пункт2, Пункт1) ),
    Пункт1 \= Пункт2.

пересадка(Транспорт, Пункт1, Пересадка, Пункт2) :-
    достижимо(Транспорт, Пункт1, Пересадка),
    достижимо(Транспорт, Пересадка, Пункт2),
    Пункт1 \= Пересадка, Пересадка \= Пункт2, Пункт1 \= Пункт2.

можно_доехать(Транспорт, Пункт1, Пункт2) :-
    можно_доехать(Транспорт, Пункт1, Пункт2, [Пункт1, Пункт2]).

% use_module(library(pprint)).
% print_term(X, []).

можно_доехать(Транспорт, Пункт1, Пункт2, Пересадки) :-
    достижимо(Транспорт, Пункт1, Пункт2),
        format('~s\t\t→ ~s (~s)\n\n', [Пункт1, Пункт2, Транспорт]);

    пересадка(Транспорт, Пункт1, Пересадка, Пункт2),
        \+ member(Пересадка, Пересадки),
        format('Пересадка: ~s\t→ ~s (~s)\n           ', [Пункт1, Пересадка, Транспорт]),
        можно_доехать(Транспорт, Пересадка, Пункт2, [Пересадка|Пересадки]);

    можно_доехать(Транспорт, Пункт1, Пересадка, [Пересадка|Пересадки]),
        можно_доехать(Транспорт, Пересадка, Пункт2, [Пересадка|Пересадки]),
        Пункт1 \= Пересадка, Пересадка \= Пункт2, Пункт1 \= Пункт2
    .
